post_cb({"11495327": {"Id": "11495327", "PostTypeId": "2", "Body": "<p>It appears that ideone doesn't display warnings, it only displays the compiler output if there was an error.  On the version of GCC that ideone is using (gcc 4.3) this isn't an error, it's just a warning.  </p>\n", "LastActivityDate": "2012-07-15T20:23:33.013", "CommentCount": "0", "CreationDate": "2012-07-15T20:23:33.013", "ParentId": "11495292", "Score": "3", "OwnerUserId": "36384"}, "11495325": {"Id": "11495325", "PostTypeId": "2", "Body": "<p>Not returning a value from a non-void function is a mistake, but not all compiler treats it as an error -- for example, GCC only emits a warning when it encounters this. Other compilers may be paranoid (and they're right) and don't let you compile such code. Of course compiler behavior may be modified using different switches and options.</p>\n<p>The return value of 0 is just a random value -- it might equally be 255, -1 or any other garbage, as doing this is undefined behavior (except for main, for which C99 specifies that an implicit 0 return value should be assumed).</p>\n", "OwnerDisplayName": "user529758", "LastActivityDate": "2012-07-15T20:23:24.623", "Score": "3", "CreationDate": "2012-07-15T20:23:24.623", "ParentId": "11495292", "CommentCount": "0"}, "bq_ids": {"n4140": {"so_11495292_11495319_0": {"length": 12, "quality": 1.0, "section_id": 3913}}, "n3337": {"so_11495292_11495319_0": {"length": 12, "quality": 1.0, "section_id": 3773}}, "n4659": {"so_11495292_11495319_0": {"length": 9, "quality": 0.75, "section_id": 4799}}}, "11495292": {"ViewCount": "823", "Body": "<p>Ok so I was messing around on <a href=\"http://ideone.com\">Ideone</a> and accidentally submitted this piece of code, however to my surprise it actually compiled and ran outputting a value of 0, <a href=\"http://ideone.com/Lkbjo\">here</a>.</p>\n<pre><code>#include &lt;iostream&gt;\n\nusing namespace std;\n\nconst int five(  )\n{\n        const int i = 5;\n}\n\nint main() {\n        cout &lt;&lt; five(  ) &lt;&lt; endl;\n        return 0;\n}\n</code></pre>\n<p>I then tried this in Visual Studio, and on <a href=\"http://codepad.org\">Codepad</a> however both failed to compile because <code>five()</code> does not return a value, as one would expect. My question, is of course, why does this compile fine on <a href=\"http://ideone.com\">Ideone</a> even though the code, to my understanding is wrong and shouldn't compile.</p>\n", "AcceptedAnswerId": "11495319", "Title": "Why does this compile on Ideone?", "CreationDate": "2012-07-15T20:18:37.590", "Id": "11495292", "CommentCount": "0", "PostTypeId": "1", "LastActivityDate": "2012-07-15T21:20:58.593", "Score": "9", "OwnerUserId": "862396", "Tags": "<c++>", "AnswerCount": "4"}, "11495337": {"Id": "11495337", "PostTypeId": "2", "Body": "<p>The code has undefined behavior. Even though what you're doing is wrong, the compiler is not required to diagnose it. The other point is that ideone uses what is now a fairly old version of gcc. A reasonably current version of gcc (e.g., 4.7) will at least give you a warning that your function is declared to return a value, but doesn't -- but not by default. You have to turn it on with something like <code>-Wall</code> to get the warning (but as a general rule, I'd <em>always</em> use at least -Wall with gcc).</p>\n", "LastActivityDate": "2012-07-15T20:24:39.537", "CommentCount": "0", "CreationDate": "2012-07-15T20:24:39.537", "ParentId": "11495292", "Score": "2", "OwnerUserId": "179910"}, "11495319": {"Id": "11495319", "PostTypeId": "2", "Body": "<p>Plain and simply (from C++11 6.6.3 \"The return statement\"):</p>\n<blockquote>\n<p id=\"so_11495292_11495319_0\">Flowing off the end of a function is equivalent to a return with no value; this results in undefined behavior in a value-returning function.</p>\n</blockquote>\n<p>So the compiler is pretty much allowed to do whatever it wants.  Clearly, a diagnostic is something I'd prefer from a compiler, but there are times when it can be difficult to diagnose (like when the return is inside conditional logic, and the 'end' of the function would never be reached).</p>\n<p>Note that I get the following warning with GCC 4.6.1 (using the <code>Wall</code> option):</p>\n<pre><code>test.cpp:8:1: warning: no return statement in function returning non-void [-Wreturn-type]\n</code></pre>\n<p>I'm not sure what options ideone passes to GCC (I imagine that <code>-Wall</code> would do the same with the 4.3.4 version that ideone uses).</p>\n<p>Some related information:</p>\n<p>In C it's OK for a function that is declared to return a value to not actually do so in certain circumstances; in C it only results in undefined behavior if the function's return value is actually <em>used</em>. Pre-standard C didn't always support the <code>void</code> type, so functions that didn't return anything were often declared to return <code>int</code>, explicitly or implicitly. From C99 6.9.1/12 \"Function definitions\": If the <code>}</code> that terminates a function is reached, and the value of the function call is used by the caller, the behavior is undefined. </p>\n<p>Also, as mentioned in a couple comments, flowing off the end of <code>main()</code> is treated specially by C++ and C99 and later.</p>\n", "LastEditorUserId": "12711", "LastActivityDate": "2012-07-15T21:20:58.593", "Score": "14", "CreationDate": "2012-07-15T20:22:06.807", "ParentId": "11495292", "CommentCount": "7", "OwnerUserId": "12711", "LastEditDate": "2012-07-15T21:20:58.593"}});