post_cb({"13922235": {"ParentId": "13922067", "PostTypeId": "2", "CommentCount": "1", "Body": "<p>If my reading of the standard is correct, if the default constructor is not used, it won't get implicitly defined.</p>\n<p>C++11 12.1.6:</p>\n<blockquote>\n<p id=\"so_13922067_13922235_0\">A default constructor that is defaulted and not deﬁned as deleted is implicitly deﬁned when it is odr-used (3.2) to create an object of its class type (1.8) or when it is explicitly defaulted after its ﬁrst declaration.</p>\n</blockquote>\n<p>Also, a default constructor can be defined as \"deleted\", C++11 12.1.5:</p>\n<blockquote>\n<p id=\"so_13922067_13922235_1\">A\n  defaulted default constructor for class X is deﬁned as deleted if:</p>\n<ul>\n<li>X is a union-like class that has a variant member with a non-trivial default constructor,</li>\n<li>any non-static data member with no brace-or-equal-initializer is of reference type,</li>\n<li>any non-variant non-static data member of const-qualiﬁed type (or array thereof) with no brace-orequal-initializer does not have a user-provided default constructor,</li>\n<li>X is a union and all of its variant members are of const-qualiﬁed type (or array thereof),</li>\n<li>X is a non-union class and all members of any anonymous union member are of const-qualiﬁed type\n  (or array thereof), or</li>\n<li>any direct or virtual base class, or non-static data member with no brace-or-equal-initializer, has class\n  type M (or array thereof) and either M has no default constructor or overload resolution (13.3) as applied\n  to M’s default constructor results in an ambiguity or in a function that is deleted or inaccessible from\n  the defaulted default constructor.</li>\n</ul>\n</blockquote>\n<p>For example, it would appear from the above that the following program is well-formed:</p>\n<pre><code>struct X {\n  X(int) {}\n};\n\nstruct Y {\n  X x;\n};\n</code></pre>\n<p>Here <code>Y</code> does not have an implicitly defined default constructor because it's both not used and defined as deleted.</p>\n", "OwnerUserId": "367273", "LastEditorUserId": "367273", "LastEditDate": "2012-12-17T21:20:07.357", "Id": "13922235", "Score": "3", "CreationDate": "2012-12-17T21:09:00.493", "LastActivityDate": "2012-12-17T21:20:07.357"}, "13922067": {"CommentCount": "6", "ViewCount": "351", "CreationDate": "2012-12-17T20:56:27.983", "LastActivityDate": "2012-12-17T21:35:38.930", "Title": "Class with no constructor (implicit or explicit)", "PostTypeId": "1", "Id": "13922067", "Score": "2", "Body": "<p>As far as I know, you get an implicit default constructor if you do not declare any constructor yourself. As a job interview question I was asked for a situation where you do not declare a constructor but still do not get an implicit default constructor either. So you end up with a class without any constructors. It is supposed to be code that compiles, so the answer is not having a member variable that does itself not provide a default constructor. Any ideas? Searching through stack overflow and various C++ sites did not reveal anything. Also, as a hint the interviewer said it does not have to do with inheritance.</p>\n", "Tags": "<c++>", "OwnerUserId": "1245772", "AnswerCount": "3"}, "13922401": {"ParentId": "13922067", "CommentCount": "2", "Body": "<p>No, there is no such trick, unless it's a catch in the exact wording of the question.</p>\n<p>12.1p5:</p>\n<blockquote>\n<p id=\"so_13922067_13922401_0\">If there is no user-declared constructor for class <code>X</code>, a constructor having no parameters is implicitly declared as defaulted.</p>\n</blockquote>\n<p>The implicitly declared default constructor might be defined as deleted, but it is still a member of the class.</p>\n", "OwnerUserId": "459640", "PostTypeId": "2", "Id": "13922401", "Score": "0", "CreationDate": "2012-12-17T21:22:42.217", "LastActivityDate": "2012-12-17T21:22:42.217"}, "13922569": {"ParentId": "13922067", "CommentCount": "0", "Body": "<p>Effective C++, Item 5: \"These functions [ctor, dtor, copy ctor, copy assignment operator] are generated only if they are needed [...]\"</p>\n<p>According to that, if you have a class that has no declared ctors, and you do not create any instances of that class, then your class will have no constructor(s) at all.</p>\n", "OwnerUserId": "1901983", "PostTypeId": "2", "Id": "13922569", "Score": "0", "CreationDate": "2012-12-17T21:35:38.930", "LastActivityDate": "2012-12-17T21:35:38.930"}, "bq_ids": {"n4140": {"so_13922067_13922235_1": {"section_id": 369, "quality": 0.8333333333333334, "length": 5}, "so_13922067_13922401_0": {"section_id": 369, "quality": 1.0, "length": 10}, "so_13922067_13922235_0": {"section_id": 370, "quality": 0.8095238095238095, "length": 17}}, "n3337": {"so_13922067_13922235_1": {"section_id": 359, "quality": 0.8333333333333334, "length": 5}, "so_13922067_13922401_0": {"section_id": 359, "quality": 1.0, "length": 10}, "so_13922067_13922235_0": {"section_id": 360, "quality": 0.8095238095238095, "length": 17}}, "n4659": {"so_13922067_13922401_0": {"section_id": 381, "quality": 1.0, "length": 10}, "so_13922067_13922235_1": {"section_id": 382, "quality": 0.8333333333333334, "length": 5}, "so_13922067_13922235_0": {"section_id": 384, "quality": 0.8095238095238095, "length": 17}}}});