post_cb({"22193569": {"CommentCount": "3", "ViewCount": "34", "PostTypeId": "1", "ClosedDate": "2014-03-05T11:57:35.267", "LastEditorUserId": "3237645", "CreationDate": "2014-03-05T09:27:56.993", "LastActivityDate": "2014-03-05T10:03:50.633", "Title": "Copy elision in the scenario of NRVO", "LastEditDate": "2014-03-05T10:03:50.633", "Id": "22193569", "Score": "0", "Body": "<p>In standard 12.8[class.copy], clause 31:</p>\n<blockquote>\n<p id=\"so_22193569_22193569_0\">When certain criteria are met, an implementation is allowed to omit\n  the copy/move construction of a class object, even if the copy/move\n  constructor and/or destructor for the object have side effects. In\n  such cases, the implementation treats the source and target of the\n  omitted copy/move operation as simply two different ways of referring\n  to the same object, and the destruction of that object occurs at the\n  later of the times when the two objects would have been destroyed\n  without the optimization.123 This elision of copy/move operations,\n  called copy elision, is permitted in the following circumstances\n  (which may be combined to eliminate multiple copies):</p>\n<ul>\n<li>in a return statement in a function with a class return type, when the\n  expression is the name of a non-volatile automatic object (<strong>other than\n  a function or catch-clause parameter</strong>) with the same cvunqualified type\n  as the function return type, the copy/move operation can be omitted by\n  constructing the automatic object directly into the function’s return\n  value</li>\n<li>...</li>\n<li>...</li>\n<li>...</li>\n</ul>\n</blockquote>\n<p>This clause provides standard's definition for copy elision, and the first bullet there describes one of the scenario of copy elision, which I guess is usually referred to as named return value optimization (NRVO).</p>\n<p>My question is about the bolded part above.  Why function parameter is excluded from possible copy elision (NRVO)?  what is more, the bolded part doesn't exist in C++03 standard.  What happened in between?</p>\n", "Tags": "<c++><documentation>", "OwnerUserId": "3237645", "AnswerCount": "0"}, "bq_ids": {"n4140": {"so_22193569_22193569_0": {"section_id": 480, "quality": 0.953125, "length": 61}}, "n3337": {"so_22193569_22193569_0": {"section_id": 471, "quality": 0.96875, "length": 62}}, "n4659": {"so_22193569_22193569_0": {"section_id": 502, "quality": 0.953125, "length": 61}}}});