post_cb({"27595993": {"ParentId": "27595793", "CommentCount": "0", "Body": "<p>I think the relevant clause is 8.5 [dcl.init] paragraph 12:</p>\n<blockquote>\n<p id=\"so_27595793_27595993_0\">If no initializer is specified for an object, the object is default-initialized. When storage for an object with automatic or dynamic storage duration is obtained, the object has an indeterminate value, and if no initialization is performed for the object, that object retains an indeterminate value until that value is replaced (5.17). [ Note: Objects with static or thread storage duration are zero-initialized, see 3.6.2. —end note ] If an indeterminate value is produced by an evaluation, the behavior is undefined except in the\n  following cases:</p>\n<ul>\n<li>If an indeterminate value of unsigned narrow character type (3.9.1) is produced by the evaluation of:\n  <ul>\n<li>the second or third operand of a conditional expression (5.16),</li>\n<li>the right operand of a comma expression (5.18),</li>\n<li>the operand of a cast or conversion to an unsigned narrow character type (4.7, 5.2.3, 5.2.9, 5.4), or</li>\n<li>a discarded-value expression (Clause 5), then the result of the operation is an indeterminate value.</li>\n</ul></li>\n<li>If an indeterminate value of unsigned narrow character type is produced by the evaluation of the right operand of a simple assignment operator (5.17) whose first operand is an lvalue of unsigned narrow character type, an indeterminate value replaces the value of the object referred to by the left operand.</li>\n<li>If an indeterminate value of unsigned narrow character type is produced by the evaluation of the initialization expression when initializing an object of unsigned narrow character type, that object is initialized to an indeterminate value.</li>\n</ul>\n</blockquote>\n<p>I don't think any of the exception applies. Since the value is read before being initialized after the object is constructed, I think the code results in undefined behavior.</p>\n", "OwnerUserId": "1120273", "PostTypeId": "2", "Id": "27595993", "Score": "1", "CreationDate": "2014-12-22T02:50:04.840", "LastActivityDate": "2014-12-22T02:50:04.840"}, "27595998": {"ParentId": "27595793", "CommentCount": "4", "Body": "<p>You're not performing a <code>reinterpret_cast</code> (which wouldn't be safe, since the class has non-trivial initialization); you're creating a new object whose member is uninitialized.</p>\n<p>Performing lvalue-&gt;rvalue conversion on an uninitialized object gives an indeterminate value and undefined behavior.  So is the object uninitialized?</p>\n<p>According to 5.3.4 <em>all</em> objects created by <em>new-expression</em> have dynamic storage duration.  There's no exception for placement new.</p>\n<blockquote>\n<p id=\"so_27595793_27595998_0\">Entities created by a new-expression have dynamic storage duration</p>\n</blockquote>\n<p>And then 8.5 says</p>\n<blockquote>\n<p id=\"so_27595793_27595998_1\">If  no  initializer  is  speciﬁed  for  an  object,  the  object  is  default-initialized.   When  storage  for  an  object with  automatic  or  dynamic  storage  duration  is  obtained,  the  object  has  an  indeterminate  value,  and  if no initialization is performed for the object, that object retains an indeterminate value until that value is replaced (5.17).  [ Note:  Objects with static or thread storage duration are zero-initialized,  see  end note ] If an indeterminate value is produced by an evaluation, the behavior is undefined except in the following cases:</p>\n</blockquote>\n<p>and the following cases permit only <code>unsigned char</code>, and even then the value is not useful.</p>\n<p>In your case the new object has dynamic storage duration (!) and its members for which no initialization is performed have indeterminate value.  Reading them gives undefined behavior.</p>\n", "OwnerUserId": "103167", "PostTypeId": "2", "Id": "27595998", "Score": "4", "CreationDate": "2014-12-22T02:51:34.007", "LastActivityDate": "2014-12-22T02:51:34.007"}, "27595793": {"CommentCount": "12", "ViewCount": "111", "PostTypeId": "1", "LastEditorUserId": "845092", "CreationDate": "2014-12-22T02:13:11.780", "LastActivityDate": "2014-12-22T02:51:34.007", "Title": "initialize array, placement new, read variables, defined behavior?", "AcceptedAnswerId": "27595993", "LastEditDate": "2014-12-22T02:34:07.540", "Id": "27595793", "Score": "4", "Body": "<p>given a class who's only member is a <code>char[10]</code>, that has no inheritance nor virtual members, that has a constructor that does not mention the array in any way (such that it gets default-initialization -&gt; no initialization, like so:</p>\n<pre><code>class in_place_string {\n    char data[10];\n\n    static struct pre_initialized_type {} pre_initialized;\n    in_place_string(pre_initialized_type) {}  //This is the constructor in question\n\n    in_place_string() :data() {} //this is so you don't yell at me, not relevent\n};\n</code></pre>\n<p>Is it defined behavior to placement-new this class into a buffer that already has data, and then read from the array member?</p>\n<pre><code>int main() {\n    char buffer[sizeof(in_place_string)] = \"HI!\";\n    in_place_string* str = new(buffer) in_place_string(in_place_string::pre_initialized);\n    cout &lt;&lt; str-&gt;data; //undefined behavior?\n}\n</code></pre>\n<p>I'm pretty sure it's not well defined, so I'm asking if this is implementation defined or undefined behavior.</p>\n", "Tags": "<c++><language-lawyer><undefined-behavior><placement-new>", "OwnerUserId": "845092", "AnswerCount": "2"}, "bq_ids": {"n4140": {"so_27595793_27595993_0": {"section_id": 3291, "quality": 0.8723404255319149, "length": 41}, "so_27595793_27595998_1": {"section_id": 3291, "quality": 0.8695652173913043, "length": 40}, "so_27595793_27595998_0": {"section_id": 6082, "quality": 1.0, "length": 7}}, "n3337": {"so_27595793_27595998_0": {"section_id": 5850, "quality": 1.0, "length": 7}}, "n4659": {"so_27595793_27595993_0": {"section_id": 4053, "quality": 0.8723404255319149, "length": 41}, "so_27595793_27595998_1": {"section_id": 4053, "quality": 0.8695652173913043, "length": 40}, "so_27595793_27595998_0": {"section_id": 7578, "quality": 1.0, "length": 7}}}});