post_cb({"bq_ids": {"n4140": {"so_28050760_28052844_0": {"length": 11, "quality": 1.0, "section_id": 703}}, "n3337": {"so_28050760_28052844_0": {"length": 11, "quality": 1.0, "section_id": 693}}, "n4659": {"so_28050760_28052844_0": {"length": 11, "quality": 1.0, "section_id": 732}}}, "28051249": {"Id": "28051249", "PostTypeId": "2", "Body": "<p>The usual implementation of a deque is basically a vector of pointers to fixed-sized nodes.</p>\n<p>Allocating the fixed-size node clearly has constant complexity, so that's pretty easy to handle--you just amortize the cost of allocating a single node across the number of items in that node to get a constant complexity for each.</p>\n<p>The vector of pointers part is what's (marginally) more interesting. When we allocate enough of the fixed-size nodes that the vector of pointers is full, we need to increase the size of the vector. Like <code>std::vector</code>, we need to copy its contents to the newly allocated vector, so its growth must follow a geometric (rather than arithmetic) progression. This means that we have more pointers to copy we do the copying less and less frequently, so the total time devoted to copying pointers remains constant.</p>\n<p>As a side note: the \"vector\" part is normally treated as a circular buffer, so if you're using your deque as a queue, constantly adding to one end and removing from the other does not result in re-allocating the vector--it just means moving the head and tail pointers that keep track of which of the pointers are \"active\" at a given time.</p>\n", "LastActivityDate": "2015-01-20T17:12:19.983", "CommentCount": "4", "CreationDate": "2015-01-20T17:12:19.983", "ParentId": "28050760", "Score": "9", "OwnerUserId": "179910"}, "28052844": {"Id": "28052844", "PostTypeId": "2", "Body": "<p>The (profane) answer lies in containers.requirements.general, 23.2.1/2:</p>\n<blockquote>\n<p id=\"so_28050760_28052844_0\">All of the complexity requirements in this Clause are stated solely in\n  terms of the number of operations on the contained objects.</p>\n</blockquote>\n<p>Reallocating the array of pointers is hence not covered by the complexity guarantee of the standard and may take arbitrarily long. As mentioned before, it likely adds an amortized constant overhead to each <code>push_front()</code>/<code>push_back()</code> call (or an equivalent modifier) in any \"sane\" implementation. I would not recommend using <code>deque</code> in RT-critical code though. Typically, in an RT scenario, you don't want to have unbounded queues or stacks (which in C++ by default use <code>deque</code> as the underlying container) anyway, neither memory allocations that could fail, so you will be most likely using a preallocated ring buffer (e.g. Boost's <code>circular_buffer</code>) instead.</p>\n", "LastEditorUserId": "4083309", "LastActivityDate": "2015-01-20T18:48:42.280", "Score": "1", "CreationDate": "2015-01-20T18:42:42.457", "ParentId": "28050760", "CommentCount": "4", "OwnerUserId": "4083309", "LastEditDate": "2015-01-20T18:48:42.280"}, "28050760": {"ViewCount": "746", "Body": "<p>I read <a href=\"https://stackoverflow.com/questions/22306949/does-deque-provide-o1-complexity-when-inserting-on-top\">here</a> from the accepted answer that a std::deque has the following characteristic</p>\n<pre><code>1- Random access - constant O(1)\n2- Insertion or removal of elements at the end or beginning - amortized constant O(1)\n3- Insertion or removal of elements - linear O(n)\n</code></pre>\n<p>My question is about point 2. How can a deque have an amortized constant insertion at the end or beginning?</p>\n<p>I understand that a <code>std::vector</code> has an amortized constant time complexity for insertions at the end. This is because a vector is continguous and is a dynamic array. So when it runs out of memory for a <code>push_back</code> at the end, it would allocate a whole new block of memory, copy existing items from the old location to the new location and then delete items from the old location. This operation I understand is amortized constant. How does this apply to a deque ? How can insertions at the top and bottom of a deque be amortized constant. I was under the impression that it was supposed to be constant O(1). I know that a deque is composed of memory chunks.</p>\n", "AcceptedAnswerId": "28051249", "Title": "How does deque have an amortized constant Time Complexity", "CreationDate": "2015-01-20T16:46:08.377", "Id": "28050760", "CommentCount": "3", "FavoriteCount": "2", "PostTypeId": "1", "LastEditDate": "2017-11-01T18:29:18.830", "LastEditorUserId": "4832300", "LastActivityDate": "2017-11-01T18:29:18.830", "Score": "6", "OwnerUserId": "1305891", "Tags": "<c++><deque><c++03>", "AnswerCount": "2"}});