post_cb({"3214698": {"ParentId": "3213591", "CommentCount": "6", "Body": "<p>Temporaries were so consistently protected from becoming lvalues, that they are now called rvalues. But C++0x will allow temporaries to become lvalues thanks to <em>move semantics</em>. Like in this dumb snippet</p>\n<pre><code>void blah(ICanBeTemporary &amp;&amp; temp)\n{\n    temp.data = 2; //here temporary becomes lvalue\n}\n\n\n//somewhere\nblah(ICanBeTemporary(\"yes I can\"));\n</code></pre>\n<p>Now we have terminology mess. People used to call temporaries rvalues and this is called <em>rvalue reference</em>. Named objects are now considered to be non-rvalue referenced.</p>\n", "OwnerUserId": "205955", "PostTypeId": "2", "Id": "3214698", "Score": "0", "CreationDate": "2010-07-09T16:38:16.220", "LastActivityDate": "2010-07-09T16:38:16.220"}, "3213598": {"ParentId": "3213591", "PostTypeId": "2", "CommentCount": "7", "Body": "<p>No. You are returning a reference to an global double, not a temporary.</p>\n<p>The same test with a real temporary would be:</p>\n<pre><code>double foo() { return 3.0; }\nint main() {\n   foo() = 2.0; // error: lvalue required as left operand of assignment\n}\n</code></pre>\n<p>EDIT:\nThe answer was meant just to identify that the example was wrong, and I did not really want to get into the deeper discussion of whether temporaries are or not rvalues... As others have said, lvalue-ness or rvalue-ness are properties of an expression and not of the object (in the most general sense, not only class instances). Then again, the standard says that:</p>\n<blockquote>\n<p id=\"so_3213591_3213598_0\">§3.10/5 The result of calling a function that does not return a reference is an rvalue. User defined operators are functions, and whether such operators expect or yield lvalues is determined by their parameter and return types.</p>\n<p id=\"so_3213591_3213598_1\">§3.10/6 An expression which holds a temporary object resulting from a cast to a nonreference type is an rvalue (this includes the explicit creation of an object using functional notation (5.2.3)).</p>\n</blockquote>\n<p>Which AFAIK are the circumstances under which temporaries are created. Now, it is also true that you can bind a constant reference to a temporary, in which case you will get a new variable (the reference) that can be used as an lvalue that effectively refers to the temporary object.</p>\n<p>The fine line is that expressions that create temporaries are rvalue expressions. You can bind a constant reference to the result of that expression to obtain a variable that can be used as an const-qualified lvalue expression.</p>\n", "OwnerUserId": "36565", "LastEditorUserId": "36565", "LastEditDate": "2010-07-09T17:05:17.263", "Id": "3213598", "Score": "7", "CreationDate": "2010-07-09T14:31:48.503", "LastActivityDate": "2010-07-09T17:05:17.263"}, "3213820": {"ParentId": "3213591", "PostTypeId": "2", "CommentCount": "7", "Body": "<p>Temporaries and rvalues are different (but related) concepts. Being temporary is a property of an <em>object</em>. Examples of objects that aren't tempory are local objects, global objects and dynamically created objects.</p>\n<p>Being an rvalue is a property of an <em>expression</em>. The opposite of rvalues are lvalues such as names or dereferenced pointers. The statement \"Temporaries are rvalues\" is meaningless. Here is the relationsip between rvalues and temporary objects:</p>\n<blockquote>\n<p id=\"so_3213591_3213820_0\">An rvalue is an expression whose evaluation creates a temporary object which is destroyed at the end of the full-expression that lexically contains the rvalue.</p>\n</blockquote>\n<p>Note that lvalues can also denote temporary objects!</p>\n<pre><code>void blah(const std::string&amp; s);\n\nblah(std::string(\"test\"));\n</code></pre>\n<p>Inside the function blah, the lvalue <code>s</code> denotes the temporary object created by evaluating the expression <code>std::string(\"test\")</code>.</p>\n<p>Your comment \"references are lvalues\" is also meaningless. A reference is not an expression and thus cannot be an lvalue. What you really mean is:</p>\n<blockquote>\n<p id=\"so_3213591_3213820_1\">The <em>expression</em> <code>function()</code> is an lvalue if the function returns a reference.</p>\n</blockquote>\n", "OwnerUserId": "252000", "LastEditorUserId": "252000", "LastEditDate": "2010-07-10T08:25:09.223", "Id": "3213820", "Score": "9", "CreationDate": "2010-07-09T14:57:29.537", "LastActivityDate": "2010-07-10T08:25:09.223"}, "bq_ids": {"n4140": {"so_3213591_3213598_0": {"section_id": 7230, "quality": 0.5833333333333334, "length": 14}, "so_3213591_3213820_1": {"section_id": 597, "quality": 0.7142857142857143, "length": 5}}, "n3337": {"so_3213591_3213598_0": {"section_id": 6974, "quality": 0.5833333333333334, "length": 14}, "so_3213591_3213820_1": {"section_id": 5832, "quality": 0.7142857142857143, "length": 5}}, "n4659": {"so_3213591_3213820_1": {"section_id": 620, "quality": 0.7142857142857143, "length": 5}}}, "3213591": {"CommentCount": "5", "ViewCount": "304", "CreationDate": "2010-07-09T14:30:25.590", "LastActivityDate": "2010-07-10T08:25:09.223", "Title": "Rvalues vs temporaries", "AcceptedAnswerId": "3213820", "PostTypeId": "1", "Id": "3213591", "Score": "1", "Body": "<p>Somebody generalized the statement \"Temporaries are <code>rvalues</code>\". I said \"no\" and gave him the following example</p>\n<pre><code> double k=3;\n\n double&amp; foo()\n {\n    return k;\n }\n\n int main()\n {\n\n     foo()=3; //foo() creates a temporary which is an lvalue\n }\n</code></pre>\n<p>Is my interpretation correct?</p>\n", "Tags": "<c++>", "OwnerUserId": "165520", "AnswerCount": "3"}});