post_cb({"32466566": {"ViewCount": "89", "Body": "<p>I was working with another computer science student today, and he said his class was covering pointers. He was trying to understand pointers by creating an example where he was passing a pointer as an argument to a function, and setting that referenced pointer argument inside the function equal to the hypotenuse of a triangle (two of the other sides of the triangle are also passed into the function as double arguments). </p>\n<p>As I explained to him about how pointers worked, I coached him what he should do, and we ended up with something like the example code I have below. His compiler continually failed to compile despite our efforts, but the compiler for VS2013 worked okay.</p>\n<p>My question is simply this: Is there anything we're doing wrong with the code I've presented below? I did tell him that you'd probably use dynamic memory allocation instead of setting the pointer equal to the address of another variable we define in the program, but it seems baffling to me why the code won't compile. Same exact code, one compiles, the other doesn't. I just want to be sure the information I'm giving out is correct, of course.</p>\n<p>And of course, much thanks to the stackoverflow community. </p>\n<pre><code>#include &lt;iostream&gt;\n#include &lt;cmath&gt;\n\nusing namespace std;\n\nvoid hypotenuse(double a, double b, double *ptr);\n\nint main()\n{\n    //double *ptr = new double;\n    double *ptr;\n    double c;\n    ptr = &amp;c;\n\n    hypotenuse(3, 4, ptr);\n\n    cout &lt;&lt; ptr &lt;&lt; '\\n' &lt;&lt; *ptr;\n\n    cin.get();\n}\n\nvoid hypotenuse(double a, double b, double *ptr)\n{\n    *ptr = sqrt(a*a + b*b);\n}\n</code></pre>\n<p>Post was edited because we did include the cmath header, I just forgot to write it in this example because VS2013 doesn't require it. My apologies.</p>\n", "AcceptedAnswerId": "32513562", "Title": "Passing pointer as argument c++ 2 compilers different results", "CreationDate": "2015-09-08T20:20:51.357", "Id": "32466566", "CommentCount": "10", "LastEditDate": "2015-09-08T20:34:28.073", "PostTypeId": "1", "LastEditorUserId": "3499524", "LastActivityDate": "2015-09-11T00:16:16.003", "Score": "0", "OwnerUserId": "3499524", "Tags": "<c++><pointers>", "AnswerCount": "5"}, "32466855": {"Id": "32466855", "PostTypeId": "2", "Body": "<p>Both GCC and Visual C++ are conforming here. If we look to the draft C++ standard, section [res.on.headers]:</p>\n<blockquote>\n<p id=\"so_32466566_32466855_0\">A C++ header may include other C++ headers. A C++ header shall provide\n  the declarations and definitions that appear in its synopsis. A C++\n  header shown in its synopsis as including other C++ headers shall\n  provide the declarations and definitions that appear in the synopses\n  of those other headers.</p>\n</blockquote>\n<p>Somewhere in its standard library, Visual C++ decided to include <code>&lt;cmath&gt;</code>. From now on, follow good practice and always include headers for functions you use.</p>\n", "LastActivityDate": "2015-09-08T20:40:15.167", "CommentCount": "2", "CreationDate": "2015-09-08T20:40:15.167", "ParentId": "32466566", "Score": "2", "OwnerUserId": "5314522"}, "32466682": {"Id": "32466682", "PostTypeId": "2", "Body": "<p>The code as posted in this question <a href=\"http://coliru.stacked-crooked.com/a/372476377368afc6\" rel=\"nofollow\">will not compile with gcc</a> as is because it is lacking the include of the math header that defines <code>sqrt</code>. Your compiler error/warnings should clearly show this problem, pay close attention to those messages.</p>\n<p>Because <code>sqrt</code> is not part of the c++ language you have to add an include for the <code>cmath</code> header. It is <em>possible</em> that in some iteration of your friends code you had included this header directly or indirectly however without the information about the compiler used there and an exact error message this is purely speculation, you need to include that information in a question like this to get a better answer. When you include the <code>cmath</code> the code will <a href=\"http://coliru.stacked-crooked.com/a/91d06ed4ef252918\" rel=\"nofollow\">compile and run without issue</a>.</p>\n", "LastEditorUserId": "296460", "LastActivityDate": "2015-09-08T20:34:27.743", "Score": "0", "CreationDate": "2015-09-08T20:29:01.607", "ParentId": "32466566", "CommentCount": "1", "OwnerUserId": "296460", "LastEditDate": "2015-09-08T20:34:27.743"}, "32468191": {"Id": "32468191", "PostTypeId": "2", "Body": "<p>First off initializing a pointer without a value (<code>double* ptr;</code>) is bad practice and could lead to undefined behavior.</p>\n<p>Most of the time you should not declare a <code>void _ (T,T*)</code> function and should instead replace the <code>T*</code> with a return value. This allows for return value optimizations to basically inline the functional call. It also is much more readable:</p>\n<pre><code>double hyp;\nhypotenuse(3, 4, &amp;hyp);\n</code></pre>\n<p>vs</p>\n<pre><code>double hyp = hypotnuse(3, 4);\n</code></pre>\n<p>I understand that you were teaching about pointers, but still it is much better to do an example where pointers/references make sense:</p>\n<pre><code>int /* error code */\ngetyx(int* y, int* x);\n</code></pre>\n<p>Then you can use:</p>\n<pre><code>int y,x;\nif(getyx(&amp;y,&amp;x)) {\n    /* use value */\n} else {\n    /* error handling */\n}\n</code></pre>\n", "LastActivityDate": "2015-09-08T22:21:35.190", "CommentCount": "0", "CreationDate": "2015-09-08T22:21:35.190", "ParentId": "32466566", "Score": "-2", "OwnerUserId": "1692584"}, "bq_ids": {"n4140": {"so_32466566_32466855_0": {"length": 27, "quality": 1.0, "section_id": 6331}}, "n3337": {"so_32466566_32466855_0": {"length": 27, "quality": 1.0, "section_id": 6088}}, "n4659": {"so_32466566_32466855_0": {"length": 27, "quality": 1.0, "section_id": 7841}}}, "32513562": {"Id": "32513562", "PostTypeId": "2", "Body": "<p>I'm pretty close to closing this question. I don't think I will be able to get the compiler error message, and the question that was really being asked here was if I did anything wrong in the code that I shouldn't do. It seems to me that the answer to the question is, \"Well, that depends,\" and it depends on the compiler; but I would like to write code that is, of course, portable.</p>\n<p>Now, I know I've made a few small errors of bad programming practice, such as not passing by reference, forgetting to include the header for cmath, and maybe assigning a pointer to the address of an undefined variable.... and I could have made a return type instead of passing a pointer argument and so on. Although, it doesn't seem that I've done anything that should invoke the compiler error, but hey, who am I and what do I know?</p>\n<p>I cannot get the error message from the student who compiled the code, but I believe the IDE he was using was cloud nine, an online IDE that works in browser. I don't know which version of gcc or g++ it's using, and I went to the website, signed up, and was able to compile my code just fine. I can assure you it was the same exact code I used because I took it from my email, the same code he was unable to compile on his own machine or on his own account at cloud 9.</p>\n<p>So I think the answer to this question is that I haven't done anything that would violate the language of C++, if I can put it that way.\nAnyway, just thought I'd say thanks anyway, and sorry for wasting people's time.</p>\n", "LastActivityDate": "2015-09-11T00:16:16.003", "CommentCount": "0", "CreationDate": "2015-09-11T00:16:16.003", "ParentId": "32466566", "Score": "0", "OwnerUserId": "3499524"}, "32466717": {"Id": "32466717", "PostTypeId": "2", "Body": "<p>What is the wanted result of your code?</p>\n<ol>\n<li>You are calculating a hypotenuse and then </li>\n<li>Displaying pointer's address <code>ptr</code> and <code>double c</code>'s contents.</li>\n</ol>\n<p>Prossible mistakes:</p>\n<ol>\n<li>Omitted header  for the calculations inside the function</li>\n</ol>\n<h2>Solution:</h2>\n<p>add header the line:  <code>#include &lt;cmath&gt;</code></p>\n", "LastEditorUserId": "3313438", "LastActivityDate": "2015-09-08T20:35:38.193", "Score": "0", "CreationDate": "2015-09-08T20:31:35.703", "ParentId": "32466566", "CommentCount": "2", "OwnerUserId": "3313438", "LastEditDate": "2015-09-08T20:35:38.193"}});