post_cb({"42056315": {"ParentId": "42053409", "CommentCount": "0", "Body": "<blockquote>\n<p id=\"so_42053409_42056315_0\">The argumentation in the accepted answer seems logical to me but it is, based on my understanding of the variable-definition above, conflicting with the standard.</p>\n</blockquote>\n<p>There is no conflict with the standard, you've misunderstood the text you quote from §3.6.</p>\n<p>A non-static data member is not an object, so it's not a variable either.</p>\n<p>An object occupies a region of storage for the duration of its lifetime (see [intro.object]). A non-static data member declaration does not begin the lifetime of some thing that occupies a region of storage. So it doesn't create an object.</p>\n<p>When you construct an object of the class' type there will be a sub-object corresponding to the data member, but that subobject is created when the enclosing object is created, and only exists for the object's lifetime. It is not created by the declaration of the data member in the class.</p>\n<p>i.e. a subobject for the data member is created when the class object that contains it is created, not when the data member is declared.</p>\n<p>So if it's not an object, then it's not a variable.</p>\n<blockquote>\n<p id=\"so_42053409_42056315_1\"><strong>Question</strong> Are non-static non-reference data member declarations variables,</p>\n</blockquote>\n<p>No.</p>\n", "OwnerUserId": "981959", "PostTypeId": "2", "Id": "42056315", "Score": "2", "CreationDate": "2017-02-05T19:32:23.300", "LastActivityDate": "2017-02-05T19:32:23.300"}, "42055720": {"ParentId": "42053409", "PostTypeId": "2", "CommentCount": "7", "CreationDate": "2017-02-05T18:35:49.463", "Score": "3", "LastEditorUserId": "743382", "LastEditDate": "2017-02-05T18:49:57.183", "Id": "42055720", "OwnerUserId": "743382", "Body": "<p>No, as Igor Tandetnik pointed out in the comments, non-static data member declarations are never variables, because they are never objects. They are declarations that give the member an object type, but there are no objects until an instance of the class is created.</p>\n<p>Quoting <a href=\"https://groups.google.com/a/isocpp.org/d/msg/std-discussion/reQ0ZVFTu_E/5P1gRvf2DgAJ\" rel=\"nofollow noreferrer\">Richard Smith</a>:</p>\n<blockquote>\n<p id=\"so_42053409_42055720_0\">I suppose the problem is in the ambiguity of what a \"declaration of a reference\" is. I believe the intent here is that a \"declaration of a reference\" is a declaration that declares a particular name to be of reference type (which a non-static data member declaration of reference type does), not necessarily a declaration that causes the lifetime of a particular reference to begin. Conversely, a \"declaration of an object\" is intended to be interpreted as a declaration that declares a particular name to name a specific object (which a non-static data member declaration does not).</p>\n<p id=\"so_42053409_42055720_1\">That is:</p>\n<pre><code>  struct A {\n    int &amp;a;\n    int b;\n  };\n</code></pre>\n<p id=\"so_42053409_42055720_2\">'a' is a declaration of a reference, and so we need another condition to restrict it from being a variable. 'b' is /not/ a declaration of an object, so we don't need to say anything further.</p>\n<p id=\"so_42053409_42055720_3\">Suggestions on how to reword this to make it clearer would be welcome :)</p>\n</blockquote>\n<p>This was followed up as <a href=\"https://github.com/cplusplus/draft/issues/1280\" rel=\"nofollow noreferrer\">https://github.com/cplusplus/draft/issues/1280</a>, some inconsistencies were found. With some luck, this will be seen as a good opportunity to clear up the standard at the same time.</p>\n", "LastActivityDate": "2017-02-05T18:49:57.183"}, "42053409": {"CommentCount": "13", "ViewCount": "123", "PostTypeId": "1", "LastEditorUserId": "-1", "CreationDate": "2017-02-05T14:50:07.187", "LastActivityDate": "2017-02-05T19:32:23.300", "Title": "Are non-static non-reference data member declarations variables?", "AcceptedAnswerId": "42055720", "LastEditDate": "2017-05-23T10:29:30.583", "Id": "42053409", "Score": "3", "Body": "<p>I want to reshoot a question based on the answer and appending discussion of:<br>\n<a href=\"https://stackoverflow.com/a/12987466/4884487\">Why is a non static data member reference not a variable?</a>: </br></p>\n<blockquote>\n<p id=\"so_42053409_42053409_0\">A non-static data member of class doesn't create a new variable itself, it just helps you to define the properties of the class. If it did create a new variable, you'd be able to write code like this:</p>\n</blockquote>\n<pre><code>class Chamber {\npublic:\n    int pot;\n};\n\nvoid f(bool b) {\n    if (b)\n    Chamber::pot = 2;\n}\n</code></pre>\n<blockquote>\n<p id=\"so_42053409_42053409_1\">What would that even mean? Would it find every instance of Chamber and set all their pots to 2? It's a nonsense.</p>\n</blockquote>\n<hr>\n<p>However, in the current <a href=\"http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2014/n4296.pdf\" rel=\"nofollow noreferrer\">n4296 c++17 draft</a> a variable is still definened as (<code>§3.6</code>): </p>\n<blockquote>\n<p id=\"so_42053409_42053409_2\">A variable is introduced by the declaration of a reference other than a non-static data member or of an\n  object. The variable’s name, if any, denotes the reference or object.</p>\n</blockquote>\n<p>The argumentation in the <em>accepted</em> answer seems logical to me but it is, based on my understanding of the variable-definition above, conflicting with the standard.  </p>\n<p><strong>Question</strong> Are non-static non-reference data member declarations variables, and if yes, why are they considered to be so since I cannot use them in an intuitive fashion ( as e.g. <code>Chamber::pot</code> from the example in the answer )  ?</p>\n</hr>", "Tags": "<c++><language-lawyer>", "OwnerUserId": "4884487", "AnswerCount": "2"}, "bq_ids": {"n4140": {"so_42053409_42053409_2": {"section_id": 7029, "quality": 0.875, "length": 14}}, "n3337": {"so_42053409_42053409_2": {"section_id": 6775, "quality": 0.875, "length": 14}}, "n4659": {"so_42053409_42053409_2": {"section_id": 8526, "quality": 0.875, "length": 14}}}});