post_cb({"7423008": {"CommentCount": "7", "AcceptedAnswerId": "7423387", "CreationDate": "2011-09-14T21:08:38.173", "LastActivityDate": "2011-09-14T21:47:16.797", "PostTypeId": "1", "ViewCount": "472", "FavoriteCount": "1", "Title": "virtual inheritance with abstract class constructors", "Id": "7423008", "Score": "3", "Body": "<p>I got the following problem: There is an abstract base class, and two other abstract classes which virtually inherit from the base class, and as a conclusion have to call the Constructor of it, with all the needed arguments.</p>\n<p>But now, I got a \"normal\" class which does inherit both second order classes, and therefor has to call the baseclass-constructor on its own (as the base class is inherited virtually from both the second order classes), but both of the second order constructors take arguments to pass on to the base class constructor.</p>\n<p>Is it possible to somhow implement the constructors in a way that there will be no need to pass those, in that case unused, arguments?</p>\n<p>I hope I was able to precisely describe my problem, if there are any questions I will be happy to answer them.</p>\n", "Tags": "<c++><oop>", "OwnerUserId": "919434", "AnswerCount": "1"}, "7423387": {"ParentId": "7423008", "CommentCount": "5", "Body": "<p><em>FINALLY</em> found it.</p>\n<blockquote>\n<p id=\"so_7423008_7423387_0\">§ 12.6.2 / 7 [class.base.init]</p>\n<p id=\"so_7423008_7423387_1\">The expression-list or braced-init-list in a mem-initializer is used\n  to initialize the designated subobject (or, in the case of a\n  delegating constructor, the complete class object) according to the\n  initialization rules of 8.5 for direct-initialization.  The\n  initialization performed by each mem-initializer constitutes a\n  full-expression. Any expression in a mem-initializer is evaluated as\n  part of the full-expression that performs the initialization. <strong>A\n  mem-initializer where the mem-initializer-id denotes a virtual base\n  class is ignored during execution of a constructor of any class that\n  is not the most derived class.</strong></p>\n</blockquote>\n<p>So, pass the arguments.  They'll be ignored anyway.  Makes things really simple!</p>\n", "OwnerUserId": "845092", "PostTypeId": "2", "Id": "7423387", "Score": "1", "CreationDate": "2011-09-14T21:47:16.797", "LastActivityDate": "2011-09-14T21:47:16.797"}, "bq_ids": {"n4140": {"so_7423008_7423387_1": {"section_id": 434, "quality": 0.9361702127659575, "length": 44}}, "n3337": {"so_7423008_7423387_1": {"section_id": 426, "quality": 0.9361702127659575, "length": 44}}, "n4659": {"so_7423008_7423387_1": {"section_id": 452, "quality": 0.9361702127659575, "length": 44}}}});