post_cb({"bq_ids": {"n4140": {"so_8956160_8956177_0": {"length": 27, "quality": 0.7714285714285715, "section_id": 5775}}, "n3337": {"so_8956160_8956177_0": {"length": 27, "quality": 0.7714285714285715, "section_id": 5548}}, "n4659": {"so_8956160_8956177_0": {"length": 27, "quality": 0.7714285714285715, "section_id": 7232}}}, "8956220": {"Id": "8956220", "PostTypeId": "2", "Body": "<p>If the C++ implementation claims to be a conforming implementation of the C++ Standard (ISO/IEC 14882) it needs to include an implementation of both the compiler and the standard C++ library. Even for a conforming implementation the standard library doesn't have to be complete, though: there is a difference between free-standing and hosted implementations. While the former is only required to have very basic support, the latter requires that the entire implementation is provide (I think it is this way around but I keep getting confused about the terms; it may be the other way around).</p>\n<p>That said, there are various compilers which don't ship with more than a very basic library and the basic library they ship with consists of things the compiler either has to do or the run-time absolutely need to run. They don't claim to be conforming implementations, however. You would need to combine them with a library but there are several libraries you can purchase (or download, some of them are free but the free ones seem to only work with a couple of specific compilers).</p>\n", "LastActivityDate": "2012-01-21T20:03:10.193", "CommentCount": "0", "CreationDate": "2012-01-21T20:03:10.193", "ParentId": "8956160", "Score": "1", "OwnerUserId": "1120273"}, "8956160": {"ViewCount": "330", "Body": "<p>I was just curious because in my homework it says that the following statement is <em>false</em>:</p>\n<blockquote>\n<p id=\"so_8956160_8956160_0\">The C++ Standard Library functions and classes are not included in every C++ implementation.</p>\n</blockquote>\n<p>I don't think that the Standard Library is included in every C++ implementation unless you add (<code>#include</code>) the appropriate headers, right? In that case, I think that the above statement is <em>true</em>, not <em>false</em>.</p>\n<p>Is the statement <em>true</em> or <em>false</em>?</p>\n", "AcceptedAnswerId": "8956177", "Title": "Are the C++ Standard Library functions and classes included in every C++ implementation?", "CreationDate": "2012-01-21T19:55:03.463", "Id": "8956160", "CommentCount": "2", "LastEditDate": "2012-01-21T21:04:23.757", "PostTypeId": "1", "LastEditorUserId": "454780", "LastActivityDate": "2012-01-21T21:04:23.757", "Score": "1", "OwnerUserId": "454780", "Tags": "<c++>", "AnswerCount": "3"}, "8956221": {"Id": "8956221", "PostTypeId": "2", "Body": "<p>The statement is true (and your homework instructor is wrong). The standard distinguishes in 17.4.1.3 between hosted and freestanding implementations. Only the hosted implementations are required to implement the C++ standard library. The freestanding implementation is only required to have these headers:</p>\n<pre><code>18.1 Types &lt;cstddef&gt;\n18.2 Implementation properties &lt;limits&gt;\n18.3 Start and termination &lt;cstdlib&gt;\n18.4 Dynamic memory management &lt;new&gt;\n18.5 Type identiﬁcation &lt;typeinfo&gt;\n18.6 Exception handling &lt;exception&gt;\n18.7 Other runtime support &lt;cstdarg&gt;\n</code></pre>\n", "LastActivityDate": "2012-01-21T20:03:12.027", "CommentCount": "0", "CreationDate": "2012-01-21T20:03:12.027", "ParentId": "8956160", "Score": "3", "OwnerUserId": "385433"}, "8956177": {"Id": "8956177", "PostTypeId": "2", "Body": "<p>Looks like unfortunate overloading of the word \"include\".</p>\n<p>Your C++ compiler comes with files containing the standard library.  So they are \"included\".  But they aren't <code>#include</code>-d, you have to write <code>#include</code> in your source files to get access to the standard library.</p>\n<p>In addition, there are <em>hosted</em> and <em>freestanding</em> implementations.  Here's what the Standard says:</p>\n<blockquote>\n<p id=\"so_8956160_8956177_0\">Two kinds of implementations are defined: a <em>hosted implementation</em> and a <em>freestanding implementation</em>. For a hosted implementation, this International Standard deﬁnes the set of available libraries.  A freestanding implementation is one in which execution may take place without the beneﬁt of an operating system, and has an implementation-deﬁned set of libraries that includes certain language-support libraries (17.6.1.3).</p>\n</blockquote>\n<p>Since the statement says \"<strong>every</strong> C++ implementation\", and freestanding implementations do not include the entire C++ Standard Library, the statement is <strong>TRUE</strong>.</p>\n", "LastActivityDate": "2012-01-21T19:57:26.277", "CommentCount": "8", "CreationDate": "2012-01-21T19:57:26.277", "ParentId": "8956160", "Score": "5", "OwnerUserId": "103167"}});