post_cb({"9239810": {"Id": "9239810", "PostTypeId": "2", "Body": "<p>My understanding is that the C++ source is required to understand Unicode (ISO 10646). For example 2.11 [lex.name] paragraph 1 reads:</p>\n<blockquote>\n<p id=\"so_9238457_9239810_0\">An identifier is an arbitrarily long sequence of letters and digits. Each universal-character-name in an identifier shall designate a character whose encoding in ISO 10646 falls into one of the ranges specified in E.1. The initial element shall not be a universal-character-name designating a character whose encoding falls into one of the ranges specified in E.2. Upper- and lower-case letters are different. All characters are significant.</p>\n</blockquote>\n<p>Whether it is an award-winning idea to create source code which can't be read by most programmers is a different idea. In general, security by obfuscation doesn't work: even if all your identifiers are essentially unreadable by many people, the structure of the program can still be decoded. However, I can promise you that I won't give any help with programs posted e.g. over here which I can't read: I'm already put off to some extend by identifiers using the ASCII subset of Unicode but a language I don't understand. If the characters don't make any sense to me either, I have probably no inclination to spend any time on the source. Sure, in the long distant past I had created a version of gcc which used German keywords. It didn't work too well because it already didn't understand the standard headers so I dropped it even before having written the obligatory \"hello, world\"-program.</p>\n", "LastActivityDate": "2012-02-11T11:23:27.067", "CommentCount": "0", "CreationDate": "2012-02-11T11:23:27.067", "ParentId": "9238457", "Score": "2", "OwnerUserId": "1120273"}, "bq_ids": {"n4140": {"so_9238457_9239810_0": {"length": 39, "quality": 0.975, "section_id": 5333}}, "n3337": {"so_9238457_9239810_0": {"length": 39, "quality": 0.975, "section_id": 5130}}, "n4659": {"so_9238457_9239810_0": {"length": 39, "quality": 0.975, "section_id": 6754}}}, "9238457": {"ViewCount": "211", "Body": "<p>I want to use Hindi language characters in VC++ on VS2010. Is it possible, and if yes then how can I do it?</p>\n<p>I think it will involve playing around with locales, language packs etc., which I don't know much about?</p>\n<p>PC configuration:</p>\n<p>VS 2010 on Windows 7 English(India)</p>\n", "AcceptedAnswerId": "9239810", "Title": "Using Non-English characters for function/variable names in VC++?", "CreationDate": "2012-02-11T06:57:56.670", "Id": "9238457", "CommentCount": "5", "LastEditDate": "2012-02-11T07:00:09.443", "PostTypeId": "1", "LastEditorUserId": "15168", "LastActivityDate": "2012-02-11T11:23:27.067", "Score": "0", "OwnerUserId": "271359", "Tags": "<c++><visual-c++><windows-7>", "AnswerCount": "1"}});